as -o hello.o hello.s
ld -o hello hello.o
sudo apt-get install libprotobuf-dev libleveldb-dev libsnappy-dev libopencv-dev libhdf5-serial-dev protobuf-compiler
 
sudo apt-get install --no-install-recommends libboost-all-dev
 
sudo apt-get install libopenblas-dev liblapack-dev libatlas-base-dev
 
sudo apt-get install libgflags-dev libgoogle-glog-dev liblmdb-dev
 
sudo apt-get install git cmake build-essential

人生就像一个怪圈。有些年轻时候认为无足轻重的问题，年龄大了
以后可能觉得很重要，比如说一个人的修养、个性、习惯等；有些年轻
时候认为很有意义的事情，以后看来往往并没有当初想象得那么有价
值，比如说年轻时某种特别的兴趣、爱好等等。

一个人年轻时候桀骜不驯，到了不惑之年逐渐变得循规蹈矩，可能
是大多数人的必由之路，也可能是人生的某种必然吧。

人的命运可以自己选择吗？可以，你可以走你愿意走的路。但是，
一旦你上了路，回头恐怕就没有那么容易了，人生的许多事情无法重来
一次。

作为一个投机者，为了在市场波动中赚取利润，每天早上到下午，
我一直盯着国内期货市场的价格变化，忙忙碌碌地买进卖出。晚上，因
为国内国际市场联动，我需要关注芝加哥、纽约、伦敦市场各个品种的
走势，也不敢放心大胆地睡觉。偶尔，当外盘暴涨暴跌，市场走势对我
极为有利时，真想把已经酣然进入梦乡的朋友们吵醒，与他们分享快
乐；当外盘走势出现不测，和我的预期背道而驰的时候，却只能独自苦
笑，无奈地痛骂自己一顿：为何做了这么多年期货还像个白痴，竟然会
持有这么愚蠢的头寸！哎，看来明天开盘又得手忙脚乱地忙一阵子，实
在不行就狼狈逃命吧！

因此，在相当长一段时间，我在股票交易中一直遵循着下面三条基
本原则：
第一，用政治眼光来审视股票市场，抓住市场可能出现的重大变
化。国内股票市场不但过去是政策市，我觉得，今后相当长时间之内，
它依然不能完全摆脱政策市的阴影。这一点意味着，股票市场一旦出现
过于离谱的暴涨暴跌，就随时有可能出现一种外在的力量来左右市场走
势，使股市回到社会政治所能容忍的范围以内。一定的政治敏感度，是
国内股市投机者抓住战略性投资机会、获得暴利的指南针。
第二，抓住大行情可能来临的机会，长线交易、重仓交易，不贪
图小利，迷恋股市，整天在市场中炒来炒去。
第三，绝不染指垃圾股，因为垃圾股即使在大牛市中也可能没有
出头之日。即使手中股票暂时被套住，也有翻身的日子。适当的分散投
资可能是避免受到垃圾股伤害的一个简单策略。

十多年以后的今天，如果重新审视这个问题，我的认识是：预测制
胜是一条不可能成功的交易歧路，世上没有一个人、一种工具可以准
确地预测市场的未来变化。市场交易是一个动态、系统的控制过程。
理解市场价格变化、判断未来走势只是成功交易的一个环节，而且应该
不是最重要的环节。在实际操作中，每一次交易投入的资金多少；情况
不利时如何处理、有利时如何加码；加码后出现有利或者不利情况如何
应对；赢利的交易怎样既不由赢转亏，又不丧失一旦市场出现大波动带
来的暴利等等，应对这些问题的技巧、策略和方法，远比仅仅希望准确
的预测市场走势重要得多，需要投机者有一套完整、系统的交易思路。

拯救灵魂的唯一方法是禁欲、牺牲及对简单和朴素毫不动摇的坚持--马克思韦伯

。首先，市场价格，尤其是
短期价格变化能不能准确预测，实在是一个非常令人生疑的问题。我的
经验是，对一个投机者来说，比较明智的态度是，相信市场价格不能被
准确预测，把不确定性作为市场的本质，在此基础上再构建自己的交易
策略。其次，价格预测只是每一次交易的起点，只是万里长征的第一
步。从一个专业投机者的角度看，任何一笔具体的交易，都需要考虑后
面一系列更为重要的问题：第一次入市的仓位大小，止损点的确定，赢
利后什么点位加码，加多少量，多少次，加码后情况不妙怎么办，市场
出现意外情况如何处理，赢利目标在哪里，等等。显然，价格预测并不
是交易中最关键的部分。

就某一两次
局部的交易而言，确实，你对市场价格走势判断是否准确，直接决定了
交易结果是赢还是亏。但是，在成千上万次的交易以后，总的投机结
果，并不取决于局部一两次猜测的准确与否，而是取决于建立在投机者
综合实力和水平之上的市场、心理优势。投机者的市场认识、交易理
念、策略技巧、心理素质、修养境界等因素，比起市场预测能力来，对
最后的成败所起的作用更大。

一旦你在市场中建立了头寸，你对市场走势的判断就
不像原来作为旁观者时那么客观、超然、自信，你的心理、情绪会发生
巨大的变化，怀疑、焦虑、恐惧、患得患失等主观因素很可能扭曲你的
思维，使你在实际操作时陷入混乱——反复无常、自相矛盾，等等。结
果，看起来一次很单纯的顺势交易，在人的心理因素的干扰下，你也会
把它搞得乱七八糟。事后看来，你当初对市场走势的判断完全准确，但
是，很可能你非但没有从自己聪明的判断中赚到钱，还有可能亏钱。


现在我完全根据图表的信号交易，情况就大不一样了。当市场价格
有较大的波动时，我会随时用铅笔在图表上画出来，研究、分析市场目
前的状态和下一步的可能变化。
如果我手中的图表显示，市场中长期趋势上涨，而当天的盘面价格
却在下跌，只要下跌的幅度在中期趋势可以容忍的范围之内，我就不会
入市放空。相反，我可能会逆着市场的盘面走势，逢低做多。
如果图表显示市场中长期趋势是下跌，而当天的盘面价格却在反
弹，只要反弹的幅度在中期趋势可以容忍的范围之内，我就不会入市做
多。相反，我可能会逆着市场的盘面走势，逢高放空。
依靠图表显示的市场趋势操作，我的思维不再每天在多空之间摇摆
不定，变来变去。在市场短期波动的诱惑和干扰面前，我的情绪在理性
地审视后，得到了有力的控制，避免了一时冲动做出的不理智决策。
以前，我经常在盘中追涨杀跌，极短的时间内就从空头转向多头，
又从多头转向空头，反复无常。凭感觉短线交易的策略使我控制不住内
心的贪婪和恐惧，抵挡不住市场的诱惑。
现在，由于主要着眼于市场中期趋势，我的交易心理和行为变得相
对稳定、靠谱。面对每天的盘面变化，我不再神经兮兮，精神紧张，操
作次数也大为减少。第一周交易结束，我不但把第一天损失的16万元全
部弥补回来，而且还有20％多的赢利。第二、第三周，我又连续在市场
中获得了20％多的利润。

当市场价格跌到比前期低点高20来点的位置，我试探性地入市做
多。我的想法是，如果我对市场的中期走势判断错误，市场价格跌破前
一段时间形成的历史低点，就认赔出局。如果我的判断正确，我买入的
位置应该是一个很好的点位。一旦第一次交易有了浮动赢利，我将逐步
加码。


一条非
常简单而又实用的交易规则，使我避免了两次意外的伤害。这条交易规
则是：在期货交易中，如果投机者入市后三天还没有出现利润，立刻
平仓出场。我也记不清是在哪一本书上看到这个规则的，反正，我一到
商品期货市场，就非常严格而且虔诚地遵守着这一原则。

1．进入商品期货交易的第一个月，我的精神、心理状态非常好。
作为一个市场新手，因为对期货不熟悉，害怕损失，我对期货交易
抱着非常谨慎的态度。战战兢兢，如履薄冰，如临深渊。所以，每一次
入市交易前，我都会反复思考，再三权衡，在交易机会选择时非常慎
重。
作为一个市场新手，没有急躁、贪婪的欲望，也没有奢望过一夜之
间赚大钱。这样，我就能够理智、平静地看待市场波动，不慌不忙地选
择出入市机会。淡泊的心态使我的思维单纯、清晰，容易和市场运动的
节奏合拍，没有大的冲突。
作为一个市场新手，我还没有交易上的损失，所以，没有精神压力
和历史包袱，交易起来比较自由、放松。许多老手业绩不佳的一个重要
原因，就是他们在市场中吃过的亏太多，经历过痛苦的事太多，已经变
成了惊弓之鸟。即使很好的机会来临，也可能缩手缩脚，在应该大胆行
动时犹豫不决。
2．中线顺势操作策略
在国债期货交易中，因为一次偶然的原因赚了一笔大钱，所以，我
最后的交易结果还不错。但是，如果把这一次特殊情况下的赢利除外，
在大多数时间，我的国债期货交易是亏钱的。我以为，这就是频繁短线
操作的结果。我早就对自己的交易方法产生了怀疑，但苦于没有找到其
他合适的投机策略。
国债期货停止交易以后，我认真反省了自己的交易方法，也从别人
身上学到了一些经验。我认识到，中线顺势交易是期货赚大钱的最佳策
略。所以，一进入商品期货市场，我就非常自觉地运用上这种策略。
在我第一个月的商品期货交易利润中，有70％来自于绿豆9509的中
线投机。从短线炒作转到中线交易，是我这一个月期货交易成功的关
键。
3．严格的风险控制
在我第一天的交易中，第一笔绿豆交易就损失了本金的8％，但在
尾市，我能果断地砍仓离场，对风险采取严格的控制态度。后来在橡胶
以及另外一次绿豆交易中，尽管我的单子并没有亏损，根据三天交易规
则，我还是及时平仓离场，避免了意外的损失。
如果我没有采取严格的风险控制措施，这三次的交易损失可能会夺
走我大量的利润，那样这个月的业绩也就很一般了。
4．加码策略
在绿豆交易中，我很自觉地运用了试探——加码的交易策略。即在
第一次投资以后，如果市场走势证明我的判断错误，我就止损离场。如
果随后的市场走势表明我的判断正确，我就会在第一笔交易有了浮动赢
利以后，再一次一次地加码。这样，我在失误时，只会损失一点小钱，
因为刚开始时我投入的资金量不大。而一旦我的市场判断正确，通过加
码策略，我就会赚到大钱。试探——加码的交易策略让我赚大钱，亏小
钱。
5．一点运气
在我进入商品期货市场时，国内各个商品交易所中，很多品种都非
常活跃，市场机会多、价格波动幅度大，这也是我能取得成功的重要原
因。如果是我在1998年到2002年这一段时间进入期货市场，由于市场交
易品种少，价格波动幅度小，绝对不可能取得如此高的投资回报。

在期货交易中，一个人的心理、精神状态远比他拥有的市场知识和
预测技术重要得多。


有人说，期货交易的技术和知识，学一两年时间可能就够了，但
是，投机者要培养出一个稳定、良好的心态，在修养和境界上达到高瞻
远瞩、超凡脱俗，即使花上十年工夫，也不算多。此言善矣！

有人说，经验并不是指你经历过什么，而是你从经历中学到了什
么。确实，如果我能够早一点认真反思别人犯过的错误，有些悲剧也许
就可以避免


1996年3月的一天下午，我在看盘时突然发现，平时名不见经传的
海南咖啡蠢蠢欲动，成交量大幅增加。我浏览了一下咖啡市场前一段时
间的走势图，了解到咖啡价格长时间在一个狭窄的空间小幅波动。这种
横向的市场盘整走势，一旦向上突破，市场随后很可能出现大规模的趋
势运动，往往蕴涵着获取暴利的机会。这是我最喜欢、最有把握的图表
形态，当初在327国债期货上的巨大成功，就是因为我抓住了这样一个
向上突破的机会。如果咖啡真的向上越过前期高点，后期的走势很可能
就和327行情一模一样。我密切地注视着海南市场的动静，做好了随时
出击的准备。


。因为9605合约前一段时间的价格走势，是
一种我最喜欢、最熟悉的图表形态。咖啡价格长时间围绕着2700元这条
中轴线，在一个狭窄的空间小幅波动。这种图形一旦向上突破，市场很
可能就会形成强劲的上升趋势行情。交易的风险和利润简直不成比例，
风险极小，利润极大，这对投机者极为有利，是一个非常难得的机会。

羽黑法

我自己的亲身经历加上10多年来在期货市场中的所见所闻表明，因
为重仓交易而爆仓的投机者，数量上要远远少于因为逆势操作而破产的
投机者。

一旦发现自己的操作和市场趋势相反，投机者绝对不能
有侥幸心理，应该在第一时间立刻平仓。这是期货交易的一条基本原则
——止损原则。高明的投机者在顺势交易时，能放胆去赢，在判断错误
时，又能果断地壮士断臂。

这次交易让我认识到，在期货投机中，可做可不做的交易，还是
不要去碰为妙。投机者如果把精力集中在很有把握、非做不可的交易上
面，交易的业绩可能会大幅提升。

期货交易有时候确实令人奇怪，大多数人往往对市场可能来临的重
大波动反应迟钝，视而不见。无论某个商品的价格上涨或者下跌到多么
不合情理的地步，事后看来这个位置是多么的荒唐和离谱，身处其中的
投机者却往往当局者迷，很难摆脱当时的市场环境、气氛的巨大影响。
面对一种历史性的市场价格，投机者很难觉察到这有什么特别之处，认
为一切依然很正常、合理。

事后从图表上看，海南橡胶市场的这波行情，下跌趋势非常明显，
逆势交易者简直是个大笨蛋。在这样单纯的走势中，我非但没有赚到
钱，反而亏了大钱，确实令局外人难以理解。作为一个专业投机者，有
好几次，当我向别人解释这段时间的交易我是如何赔钱的时候，简直羞
于启口，内心感到非常惭愧。那么，我当时做多海南橡胶的理由是什么
呢？
1．短线交易方式隐含的天然缺陷
市场趋势的力量确实非常强大，我做梦都没有想到，第二天，橡胶
市场竟然会低开200多点，前一天尾市的强势消失得无影无踪
我想利用短线操作捕捉更多的市场机会，看似聪明，实则愚笨；看
似跑得很快，实则离目标越来越远。
有一句名言说得好：过于注重细节的人，往往对大事情一无所知。
2．总比市场慢一拍的思维
投资大师巴菲特曾经挖苦过那些基金经理们，说他们总是喜欢看着
汽车的后视镜开车。巴菲特的意思是说，基金经理们总是犯经验主义错
误，以为历史会简单地重复，未来就是过去的再现。

3．我迷失在短期波动的大海里
投机者很容易被市场短期波动搞糊涂，沉溺其中而失去超然的思
维、心态，忘记市场大趋势的方向。我在橡胶市场陷入逆势交易的境
地，从某种意义上说，并不是我故意要和市场作对，而是因为短线操作
的习惯，让我不知不觉中，稀里糊涂地变成了一个逆势交易者。

4．市场趋势会突然反转吗？——新手的心理、思维陷阱
记得有一个投机高手曾经表达过这样一个观点：在市场交易中，投
机者应该做出正确的决策，而不是做出让自己感觉舒服的决策。心理上
很舒服的交易，结果往往不好。
5．R708市场价格的下跌过程中，持仓量每天都在增加
从中，我学到了两点：
一是在市场价格判断上，价格变化本身透露出的信息远比持仓量、
成交量的意义重要。在早期的期货交易中，我曾经对此迷惑不解。为了
预测市场价格的走势，把很多精力集中在分析持仓量、成交量的微妙变
化上，钻牛角尖，误入歧途。
二是对一个投机者来说，不要去参考市场中别人的行为，从众是通
向地狱最廉价的门票。

从理智上说，当市场价格
跌破我的入市点时，我必须平仓出局，控制风险；但从感情上，我又舍
不得在亏损的情况下离场。
现代决策心理学的研究表明，当一个人的内心充满矛盾和冲突时，
最典型的行为特征是不采取任何行动。

？由此，我们可以学到两点有价值的教
训：①没有有效止损的投机交易极为危险，亏得倾家荡产是早晚的事；
②顺势交易有可能把投机者带到成功的彼岸。



12冥河的摆渡者

当时，我采用的是市场价格和一条平均线的穿越和突破作为入市信
号。
经过反复测试，最后我选择了市场价格和55个15分钟价格的平均线
的穿越作为入市交易的信号。市场价格向上突破15分钟的55均线，我就
买进做多；反之，我就卖出做空。
我进场以后，如果市场随后的走势没有证明我是正确的，我一般会
在出现10到20点左右的亏损时就砍仓离场。而一旦方向准确，我就持仓
等待。在很多次交易中，我都获得了200点以上的利润。这样，只要我
做对一次交易，即使随后犯了十次错误，也不会有大的损失。

有了这套交易系统，在随后一段时间的天津红小豆交易中，我不再
神经紧张地盯着盘面变化，整天揣摩主力的动向，希望预测市场未来的
走势。现在，我唯一需要关注的就是市场价格什么时候和移动平均线交
叉，只要市场一出现我设定的行动信号，我就迅速出击。如果没有交易
信号出现，我就袖手旁观，在场外耐心等待。

后来，在上海橡胶市场的实际交易中，我发现这种做法有问题。有
些突破信号发生以后，我入市交易的利润可能很大；有些信号则只有一
点蝇头小利，而且如果我平仓速度慢一点的话，非但这点小小的浮动赢
利会转瞬即逝，而且还经常出现大的损失。
所以，我就加了另外的一个规则来作为我的交易系统的补充，限制
某些方向的交易。即遵守这样一个原则：多头市场不放空，空头市场不
做多。
这样，我的交易就变成了顺势而为，交易次数确实减少了一些，但
安全性、可靠性增加了。

在空头市场中，根据我的交易规则，每次市场反弹结束，跌破55天均线时就大胆放空。
这是一种有约束、有优势的交易模式。
在多头市场中，市场价格跌破55天均线，不做空。而当市场调整结
束，市场价格重新向上穿越55天均线时，入市做多。止损点放在当日最
低位以下。
在空头市场中，市场价格向上穿过55天均线，不做多。而当市场反
弹结束，市场价格重新向下穿越55天均线时，入市做空。止损点放在当
日最高点位以上。

现在，包括55天均线在内的不同参数的移动平均线，已经成为我观
察、理解市场，把握重大交易机会的核心工具。只有当市场发出明确的
突破信号，符合我的交易模型时，我才入市交易。
我认为，投机者应该走在市场的前面，不能只是让市场牵着自己的
鼻子走。如果投机者头脑中没有像移动平均线这样一些事先预定的原
则、框架、模型，那么，漫无目的的市场观察，得到的将只是随机的、
没有规律的价格波动。
在我看来，移动平均线不是一种市场价格预测工具，而是帮助投机
者监控市场、提高交易胜算的操作工具。而这也是我在天津红小豆这个
妖异至极的市场气氛下体悟最深的一环。

lifo
没有理论指导的实践是盲目的实践。
天不生仲尼，万古长如夜

《股票作手回忆录》是一本非常系统、全面、深刻的交易经典读
物。从内容上看，大致可以分为三大类：市场认识、交易策略和投机者
的心理、精神态度。

所谓市场认识，就是里费默对股票、期货市场的重大原则问题的基
本观点。包括市场趋势出现的原因；市场价格变化的必然性和偶然性关
系；操纵行为对股票、期货价格的影响；意外事件的发生与市场重大趋
势的关系等。
所谓交易策略，就是里费默应对市场价格变化的基本方法、策略和
技巧。包括入市时机、点位的选择、投入资金的安排、出现有利或者不
利局面时如何处理、什么时候是最佳离场时机等。
所谓投机者的心理、精神态度，在里费默看来，包括投机者对待金
钱的态度；如何看待交易时的亏损和赢利；在长线交易中，投机者如何
从心理上做好市场短期大幅回调的准备，坚定持仓信念；在市场趋势没
有明显的反转信号出现以前，投机者如何处理手中赢利的交易；为什么
投机者常常喜欢盲目而频繁的交易；为什么投机者对内幕消息乐此不
疲，等等。
这些对每一个市场参与者意义重大、事关投机者生死存亡的复杂问
题，书中用一个个非常生动的案例娓娓道来，用作者的亲身经历言传身
教，让读者兴趣盎然，回味无穷，在潜移默化中受到深刻的启迪。

每当我陷入交易的低谷，对股票、期货的操作失去信心和希望的时
候，重读里费默的书，往往会给我灌输巨大的精神力量。更为神奇的
是，通过直接模仿他的操作策略，有好几次，在很短的时间内，我都在
市场交易中获得了不菲的收益。

我以为，每一个想进入股票、期货市场的人，每一个在股票、期货
市场上摔过跤的人，都应该仔细研读这部投资经典。有人说，从这本书
中你对自己和市场的了解，比在市场中亲身摸爬滚打几年还要来得多。

（一）对市场的认识
而里费默告诉我：
“只要条件具备，股市该是牛市就是牛市，该是熊市就是熊

认识了市场趋势产生、持续的必然性以后，我对自己的行动变得胸
有成竹，我完全没有必要匆匆行事。按照里费默的说法，“市场一定会
对我的胃口的。”
里费默自己是怎么做的呢？他说：
“我将主要精力放在了判断到底投资的是什么股市上面。”
“我从具体事件考虑到基本原则，从价格波动考虑到基本条件。”
“我的伟大发现在于人必须研究总条件、衡量条件，由此能够预知
可能性。”
“我已卖出10万股，已经看到股价会反弹，我已预料到这种情况会
出现，（如果我马上获利平仓）这样我就可赚得100万美元，然而我仍
按兵不动，眼睁睁地看着50万利润消失，简直没有想过先买回抛出的股
票，等股价反弹时再抛出去。因为那样做，我就失去了位置
（position），坐得住，一定会赚大钱，只有大的起落，你才会赚大
钱。”“
失去自己的位置（position）是谁都付不起的代价，甚至洛克菲
勒。”
（二）交易策略
1．关于短线交易和长线交易
“盲目而频繁的交易是造成华尔街投资者亏损的主要原因，即使在
专业投资者中，也是这样。但我必须做正确的选择，我不能草率行事，
所以我静等着。我赚大钱的秘密就是我常常只是静静地坐着。”
“有些华尔街的呆子，他们认为要不停地做交易。任何人都没有足
够的理由，每天买卖股票。”
“（赚大钱）不能靠看盘，而在于估价整个股市行情和走势。”
因为里费默的教育，后来，我逐渐摆脱短线交易的诱惑，开始有意
识地从事中长线交易。里费默让我从一个日内交易者、短线交易者逐渐
变成为一个中长线交易者，一个自觉的趋势交易者。此后，我不再沉溺
于短线交易，尽一切可能在绿豆、大豆、橡胶、铜市中寻找市场趋势，
顺势操作。
2．关于试探——加码的交易策略
当我看到里费默的交易策略以后，我感觉自己原来的行为极其愚
蠢。里费默彻底改变了我以往交易中那种要么大赚一笔，要么输得一塌
糊涂的愚笨的交易方法。我学到了亏小钱、赚大钱的交易手法，这就是
里费默的试探——加码的交易策略。
里费默认为，如果一个投机者看好市场，想买500股股票。他不应
该赌博式地一次性买入。假如他买了100股，结果立刻亏了，他就不应
该买更多。他应该马上看出自己错了，至少暂时错了。第一步走完以
后，除非真的有利润，否则不要采取第二步，观察、等待，直到良好时
机来临时才重新开始。职业的投机家对猜测、赌博不感兴趣，他只想要
赚稳妥的钱。而要做到这一点，就必须在能够赢的时候下大注，而输的
时候只是亏了一点点探测性的赌注。
现在，我在期货交易中，总把自己的投机资金分成三支部队。如果
我发现某个市场品种有利可图，我就派出先头部队投石问路。情况不
妙，立刻逃跑，损失往往不大。一旦市场走势与我的预测相符，我的第
一部分交易有了浮动赢利，而且市场表现良好，我就派出第二支部队加
码。第三支部队一直作为后备力量，很少动用。只有在我对市场走势稳
操胜券，前面的交易已经有了可观的利润的情况下，才偶尔让它去做点
锦上添花的事情。
总之，里费默判定大趋势、长线持仓的观点，让我在期货交易中确
立了投机优势，而尝试——加码的交易方法使我能在风险很小的情况
下，更加完美地贯彻我领悟到的投机理念，获取市场长期波动带来的可
观利润。
（三）精神态度
为什么一个人要把主要精力集中在判断市场的大势方向上？里费默
告诉我：
多头市场股票价格大幅度的上升，空头市场剧烈的下跌，都不是由
于个别投机家人为操纵的结果，而是由基本的经济形势、经济因素决定
的。多头市场或空头市场的气候一旦形成，它就有自身的巨大力量，任
何人都不能阻挡它前进的步伐。除了个别例外，牛市中所有股票都会上
涨，熊市中所有股票都会下跌，这是市场的普遍规律。
如何看待、处理交易中的损失？里费默告诉我：
“为了抓住一次重大的市场波动，投机者损失一点小钱是无法避免
的，也是可以接受的。因为你不赌就永远不知道什么时候你该大胆出击
了。”

为什么一个人要把主要精力集中在判断市场的大势方向上？里费默
告诉我：
多头市场股票价格大幅度的上升，空头市场剧烈的下跌，都不是由
于个别投机家人为操纵的结果，而是由基本的经济形势、经济因素决定
的。多头市场或空头市场的气候一旦形成，它就有自身的巨大力量，任
何人都不能阻挡它前进的步伐。除了个别例外，牛市中所有股票都会上
涨，熊市中所有股票都会下跌，这是市场的普遍规律。
如何看待、处理交易中的损失？里费默告诉我：
“为了抓住一次重大的市场波动，投机者损失一点小钱是无法避免
的，也是可以接受的。因为你不赌就永远不知道什么时候你该大胆出击
了。”
在里费默的交易经历中，经常在赚大钱以前的试探中损失几万美
元，在他看来这是很正常的，他并不在乎。
“你是一流的输家，你也因此而成为一流的赢家。”
为什么坚持不动，一定会赚大钱？里费默告诉我：
世界上没有一个人能够抓住市场所有的波动。多头市场中逢高卖
出，等到市场回调以后再低价买入；空头市场中逢低买入，等到市场反
弹以后再抛出，这种看似聪明的短线操作方法其实并不明智。多头市场
上买进股票并牢牢持股不动，空头市场中卖出股票并且长时间地持有空
头部位不轻率平仓，这才是正确的做法。重大的利润只能来自于市场价

格的重大波动。
“只有既能驾驭股市又能坐得住的人才算了不起，这的确最难做
到，但只有真正做到了，投机者才能赚大钱。”
什么是投机，什么又是赌博？里费默告诉我：
仅仅依靠观察盘面迹象，赚取一两个点利润的炒作方式是一种赌
博。利用短期价格反复无常，来回炒作的人是赌客。而投机则要预测市
场价格长期的变化，根据市场价格中长期变化的趋势交易。短期价格变
化具有极大的偶然性，而中长期价格变化则有一定的必然性。赌博主要
靠运气和天赋，而投机则主要靠知识和技巧。
面对交易赢利时，因为担心市场趋势突然反转，我往往急于兑现利
润，害怕已经看见的东西得而复失。里费默说：
“市场很明显地按我的思路进行着，我没有必要整天坐在显示牌
前，时刻盼望着得到什么信息脱手。在退却的响亮号角吹起以前，当
然，这不包括出人意料的大灾难，股市会犹豫，或者为我准备一个逆向
的投机形势。”
为什么要采用试探——加码的交易策略？里费默告诉我：
“一个投机者如此行动，那么，他在市场判断正确时，可能赚到大
钱；而在市场判断错误时，只会损失一点小钱。”
为了东山再起，他又是如何行动的？
“我太急于开始投资了，其他事情想都没想，但是，我还是控制住
自己。”
“我端坐在那儿，不是倾听心中喋喋不休的希望和闹闹嚷嚷的信
念，而是只留意来自经验的平稳声音和常识的忠告。只要我一旦筹集到
像样的股资，就可以抓住这些机会，但是，没有股资，抓机会，哪怕是
微不足道的机会，都是力所不能及的奢望。最终，还是自己的常识战胜
了贪婪和希望，耐心等待了六周。”
“在那等待最佳时机的六个星期，是我度过的最使人紧张和疲乏的
六个星期。但是，我得到了回报。”

本案例的教训：
（1）假如你判断市场大势将要反转，想做空头交易，在熊市还没
有真正到来之前，应该先试探性地投入一点小单子，而不能一上来就重
仓出击，投入过多的资金。如果试探性的交易失败了，你就退出，损失
不大；如果成功了，你就在适当的时候加码！牛市做多时也应该这样。
（2）市场走势难免一波三折，直上直下的可能性很小。如果你对
市场的未来走势有坚定的信念，入市以后，你需要忍受市场在一定程度
上与你选择的方向背道而驰，要牢牢地坚持自己的观点不动摇。投机者
不能对市场短期的风吹草动过于敏感，惊慌失措地胡乱砍仓。期货交易
需要有严格的止损意识，但不能轻率、无原则地改变自己的市场观点。
短期市场价格变化有很大的随机性、偶然性，但这并不能改变市场的根
本趋势

两条经验：
在强劲的趋势行情的早期或者中期，无论市场趋势是上涨还是下
跌，也不用管市场价格高低，如果有一天因为一个偶然的原因，例如交
易所的一个政策、市场里传来的一条意外消息或者其他你不知道的原
因，期货价格短时间突然出现和原来趋势方向相反的大幅运动，这时
候，投机者可以逆着当时市场的运动方向操作。如果原来的趋势是上
涨，目前市场价格出现急速下跌，你就买进；如果原来的趋势是下跌，
而现在市场价格在大幅上涨，你就入市放空。
一般情况下，往往在很短的时间内，这种让顺势交易者心惊胆战的
骚动走势就会结束，市场价格就会回到原来趋势的方向。有时候，市场
恢复的速度飞快，几分钟以后我就获利丰厚；但也有几次，市场恢复得
慢一点，直到第二天，市场走势才回到原来趋势的轨道。
这一条看似简单朴素的经验，让我在很多次交易中赚到了钱。
因为谁也不知道市场什么时候会出现令人意外的变化，这条经验往
往在你不经意时才会派上用场。
我有这么一条经验，当市场价格对明显的利多或者利空消息麻木
不仁、置之不理时，投机者应该采取和消息的方向相反、和市场实际
的走势方向一致的操作方式。通过市场对不利消息的反应方式，投机
者可以提早察觉市场未来的运动方向。

。聪明的投机者应
该能够从市场对消息的反应方式中，提前知道未来的走势。

当市场价格对明显的利多或者利空消息麻木不仁、置之不理时，投
机者应该采取和消息的方向相反、和市场实际的走势方向一致的操作方
式。这一条我从大豆市场得出的经验，在上海橡胶市场的这次交易中，
又一次得到了完美的证明。

我有一个经验，在缓慢上涨的行情中，如果市场涨势突然出现加
速，这往往就是市场将要见顶的信号。当然，有时候这种加速上涨的走
势会持续几天，这要看具体的情况，我也不敢太确定。但是，对待加速
行情，我总是比较警惕。所以，当时我平了一半仓，剩下的单子准备见
机行事。

，在期货交易中，为了抓住大的市场波动，一
个人不应该整天盯着盘面的变化，寸步不离。
大行情不会一天之内刚开始就结束，它有一个发展过程。投机者必
须给市场足够的时间，这意味着，投机者没有必要天天注意市场运动的
细节，忽略它，离市场远一点。

我有一个看图经验，在大幅下跌以后的市场行情中，如果市场价格
连续两周上涨，周K线都是中等长度的阳线，后市往往极度看好。在很
多次的交易中，我都利用过这条经验，基本上都有不错的收获。

本章的最后，我想再一次借用投机大师里费默的两句话作为结束：
只有既能驾驭股市又能坐得住的人才算了不起，这的确最难做
到，但只有真正做到了，投机者才能赚大钱。

“市场很明显地按我的思路进行着，我没有必要整天坐在显示牌
前，时刻盼望着得到什么信息脱手。在退却的响亮号角吹起以前，当
然，这不包括出人意料的大灾难，股市会犹豫，或者为我准备一个逆向
的投机形势。”




投机者的修养和境界并不神秘，也不玄虚，它是建立在两个方面之
上的。一是投机者对市场的理解、对市场交易中一些重大的原则性问题
的基本态度；二是投机者对自我的认识，这种认识既包括对人类千百年
来亘古不变的本性，如希望、贪婪、恐惧、侥幸、自负等的洞察和了
解，也需要投机者对自己特殊的心理弱点、性格缺陷、思维、行为习惯
等主体身心活动的深刻反省。
股票、期货市场的投机游戏是人与人之间思想、意志、心理的对抗
与较量。对市场的理解和对自我的认识这两方面之间，本质上是相互影
响、相互制约的。
早在100多年以前，一位投机市场的老手就说过这样的话：成功的
股票、期货投机定律是建立在这一假设的基础之上的，那就是，人们将
重复过去的错误。
因此，投机者对人性的认识越深刻，对市场的理解就越深入；反之
也是。从这种意义上说，股票、期货的交易实质也就是一种心理游戏，
既是与市场中其他人的角逐，更是与内心自我本能、人性弱点的对抗。

一个成功的投机高手，往往既有深刻的市场
见解，也能洞悉自己的内心世界，同时在这两方面达到很高的修为。

17境界
1.关于冲动性交易的问题
许多经验丰富的老手都认识到，冲动性交易具有巨大的破坏性，严
重威胁投机者的资金安全。
冲动性交易的主要原因是投机者缺乏足够的自我控制能力，沉溺于
短时间从市场波动中赚一笔大钱的想法而无法自拔。既不能抵挡外在的
市场波动的诱惑，也不能遏制内在强烈的交易欲望。从交易理念来说，
冲动性交易是一种短线交易，而且是超级短线。
现在，我已经很少从事短线交易，尤其是日内短线交易，知道这是
毁灭投机者最快捷的途径。我把自己的注意力完全集中在寻找、发掘中
长线交易的机会上，对短时间从市场波动中赚一笔大钱的想法已不感兴
趣。原来像裸体美女一样诱人的市场短期波动，再也不能激起我的交易
欲望和冲动。
星星还是那颗星星，月亮还是那个月亮。市场依然在激烈动荡，用
看似巨大、可观的利润，诱惑、吸引着一批又一批新老投机者前赴后
继，飞蛾扑火。而这一切，在我眼里已有了全然不同的意义。
冲动性交易，那还是一个问题吗？我问自己。

2.关于止损问题
每一本关于期货交易的书，都会不厌其烦地提醒投机者，交易不利
时要及时止损，迅速退出市场以减少损失。“如果你不愿意亏小钱，迟
早就会亏大钱”、“刚开始时的损失总是最廉价的损失”等等。
尽管有如此多的提醒和忠告，面对交易不利的局面，投机者普遍性
的习惯仍然是不愿迅速认赔，避免重大亏损的发生。理性上，一个投机
者可能认识到止损的重要性，但在实际交易中却往往做不到。

在交易明显出现不利局面时，迅速改变自己的想法、推翻原来的市
场判断、承担实实在在的损失，这一切都会给投机者带来沉重的心理、
精神负担。
问题又回到了起点。
只要我还在期货市场从事投机交易，止损是帮助我躲过重大灾难的
唯一办法。尽管每一次砍仓都要经历一次精神上痛苦的折磨，但是，鸵
鸟式的逃避显然无济于事。如果你不能控制风险，风险迟早就会控制
你。

。只要你从市场交易中赚取的利润远远大于止损时造成的
损失，你的某一笔具体交易是赚是赔无关紧要。赔小钱，赚大钱，这是
期货交易必须坚持的最简单的思考原则

